package edu.xmu.test.javase;

import org.junit.Test;

public class CountryTransformer {

	@Test
	public void getCountryInfo() {
		RegisterSupportMobileArea[] values = RegisterSupportMobileArea.values();
		for (RegisterSupportMobileArea registerSupportMobileArea : values) {
			// <option value="CN">China(中国)</option>
			System.out.println("<option value=\"" + registerSupportMobileArea.toString() + "\">"
					+ registerSupportMobileArea.getAreaEnglishName() + "(" + registerSupportMobileArea.getAreaName()
					+ ")</option>");
		}
	}

	public static enum RegisterSupportMobileArea {
		CN(1, "中国大陆", "^(86){0,1}1\\d{10}$", "86", "CN", "ZhongGuoDaLu", "China", "中國", 1000), HK(2, "香港",
				"^(00){0,1}(852){1}0{0,1}[1,5,6,9](?:\\d{7}|\\d{8}|\\d{12})$", "852", "HK", "XiangGang", "Hong Kong",
				"香港", 1002), MO(3, "澳门", "^(00){0,1}(853){1}6\\d{7}$", "853", "MO", "AoMen", "Macau", "澳門", 9999), TW(4,
						"台湾", "^(00){0,1}(886){1}0{0,1}[6,7,9](?:\\d{7}|\\d{8}|\\d{10})$", "886", "TW", "TaiWan",
						"Taiwan", "臺灣", 1001), KR(5, "韩国", "^(00){0,1}(82){1}0{0,1}[7,1](?:\\d{8}|\\d{9})$", "82", "KR",
								"HanGuo", "South Korea", "韓國", 1006), JP(6, "日本",
										"^(00){0,1}(81){1}0{0,1}[7,8,9](?:\\d{8}|\\d{9})$", "81", "JP", "RiBen",
										"Japan", "日本", 1005), US(7, "美国", "^(00){0,1}(1){1}\\d{10,12}$", "1", "US",
												"MeiGuo", "United States of America", "美國", 1007), CA(8, "加拿大",
														"^(00){0,1}(1){1}\\d{10}$", "1", "CA", "JiaNaDa", "Canada",
														"加拿大", 1008), GB(9, "英国",
																"^(00){0,1}(44){1}[347-9](\\d{8,9}|\\d{11,12})$", "44",
																"GB", "YingGuo", "United Kingdom", "英國", 9999), AU(10,
																		"澳大利亚", "^(00){0,1}(61){1}4\\d{8,9}$", "61",
																		"AU", "AoDaLiYa", "Australia", "澳洲",
																		1009), SG(11, "新加坡",
																				"^(00){0,1}(65){1}[13689]\\d{6,7}$",
																				"65", "SG", "XinJiaPo", "Singapore",
																				"新加坡", 1004), MY(12, "马来西亚",
																						"^(00){0,1}(60){1}1\\d{8,9}$",
																						"60", "MY", "MaLaiXiYa",
																						"Malaysia", "馬來西亞",
																						1003), TH(13, "泰国",
																								"^(00){0,1}(66){1}[13456789]\\d{7,8}$",
																								"66", "TH", "TaiGuo",
																								"Thailand", "泰國",
																								9999), VN(14, "越南",
																										"^(00){0,1}(84){1}[1-9]\\d{6,9}$",
																										"84", "VN",
																										"YueNan",
																										"Vietnam", "越南",
																										9999), PH(15,
																												"菲律宾",
																												"^(00){0,1}(63){1}[24579](\\d{7,9}|\\d{12})$",
																												"63",
																												"PH",
																												"FeiLvBin",
																												"Philippines",
																												"菲律賓",
																												9999), ID(
																														16,
																														"印度尼西亚",
																														"^(00){0,1}(62){1}[2-9]\\d{7,11}$",
																														"62",
																														"ID",
																														"YinDuNiXiYa",
																														"Indonesia",
																														"印尼",
																														9999), DE(
																																17,
																																"德国",
																																"^(00){0,1}(49){1}1(\\d{5,6}|\\d{9,12})$",
																																"49",
																																"DE",
																																"DeGuo",
																																"Germany",
																																"德國",
																																9999), IT(
																																		18,
																																		"意大利",
																																		"^(00){0,1}(39){1}[37]\\d{8,11}$",
																																		"39",
																																		"IT",
																																		"YiDaLi",
																																		"Italy",
																																		"義大利",
																																		9999), FR(
																																				19,
																																				"法国",
																																				"^(00){0,1}(33){1}(\\d{6}|\\d{8,9})$",
																																				"33",
																																				"FR",
																																				"FaGuo",
																																				"France",
																																				"法國",
																																				9999), RU(
																																						20,
																																						"俄罗斯",
																																						"^(00){0,1}(7){1}[13489]\\d{9,11}$",
																																						"7",
																																						"RU",
																																						"ELuoSi",
																																						"Russia",
																																						"俄羅斯",
																																						9999), NZ(
																																								21,
																																								"新西兰",
																																								"^(00){0,1}(64){1}[278]\\d{7,9}$",
																																								"64",
																																								"NZ",
																																								"XinXiLan",
																																								"New Zealand",
																																								"紐西蘭",
																																								1010), NL(
																																										22,
																																										"荷兰",
																																										"^(00){0,1}(31){1}6\\d{8}$",
																																										"31",
																																										"NL",
																																										"HeLan",
																																										"Netherlands",
																																										"荷蘭",
																																										9999), SE(
																																												23,
																																												"瑞典",
																																												"^(00){0,1}(46){1}[124-7](\\d{8}|\\d{10}|\\d{12})$",
																																												"46",
																																												"SE",
																																												"RuiDian",
																																												"Sweden",
																																												"瑞典",
																																												9999), UA(
																																														24,
																																														"乌克兰",
																																														"^(00){0,1}(380){1}[3-79]\\d{8,9}$",
																																														"380",
																																														"UA",
																																														"WuKeLan",
																																														"Ukraine",
																																														"烏克蘭",
																																														9999), AE(
																																																25,
																																																"阿联酋",
																																																"^(00){0,1}(971){1}\\d{6,12}$",
																																																"971",
																																																"AE",
																																																"ALianQiu",
																																																"United Arab Emirates",
																																																"阿拉伯聯合大公國",
																																																9999), AR(
																																																		26,
																																																		"阿根廷",
																																																		"^(00){0,1}(54){1}\\d{6,12}$",
																																																		"54",
																																																		"AR",
																																																		"AGenTing",
																																																		"Argentina",
																																																		"阿根廷",
																																																		9999), AT(
																																																				27,
																																																				"奥地利",
																																																				"^(00){0,1}(43){1}\\d{6,12}$",
																																																				"43",
																																																				"AT",
																																																				"AoDiLi",
																																																				"Austria",
																																																				"奧地利",
																																																				9999), BE(
																																																						28,
																																																						"比利时",
																																																						"^(00){0,1}(32){1}\\d{6,12}$",
																																																						"32",
																																																						"BE",
																																																						"BiLiShi",
																																																						"Belgium",
																																																						"比利時",
																																																						9999), BG(
																																																								29,
																																																								"保加利亚",
																																																								"^(00){0,1}(359){1}\\d{6,12}$",
																																																								"359",
																																																								"BG",
																																																								"BaoJiaLiYa",
																																																								"Bulgaria",
																																																								"保加利亞",
																																																								9999), BR(
																																																										30,
																																																										"巴西",
																																																										"^(00){0,1}(55){1}\\d{6,12}$",
																																																										"55",
																																																										"BR",
																																																										"BaXi",
																																																										"Brazil",
																																																										"巴西",
																																																										9999), BS(
																																																												31,
																																																												"巴哈马",
																																																												"^(00){0,1}(1242){1}\\d{6,12}$",
																																																												"1242",
																																																												"BS",
																																																												"BaHaMa",
																																																												"Bahamas",
																																																												"巴哈馬",
																																																												9999), BY(
																																																														32,
																																																														"白俄罗斯",
																																																														"^(00){0,1}(375){1}\\d{6,12}$",
																																																														"375",
																																																														"BY",
																																																														"BaiELuoSi",
																																																														"Belarus",
																																																														"白俄羅斯",
																																																														9999), BZ(
																																																																33,
																																																																"伯利兹",
																																																																"^(00){0,1}(501){1}\\d{6,12}$",
																																																																"501",
																																																																"BZ",
																																																																"BoLizi",
																																																																"Belize",
																																																																"貝裡斯",
																																																																9999), CH(
																																																																		34,
																																																																		"瑞士",
																																																																		"^(00){0,1}(41){1}\\d{6,12}$",
																																																																		"41",
																																																																		"CH",
																																																																		"RuiShi",
																																																																		"Switzerland",
																																																																		"瑞士",
																																																																		9999), CL(
																																																																				35,
																																																																				"智利",
																																																																				"^(00){0,1}(56){1}\\d{6,12}$",
																																																																				"56",
																																																																				"CL",
																																																																				"ZhiLi",
																																																																				"Chile",
																																																																				"智利",
																																																																				9999), CO(
																																																																						36,
																																																																						"哥伦比亚",
																																																																						"^(00){0,1}(57){1}\\d{6,12}$",
																																																																						"57",
																																																																						"CO",
																																																																						"GeLunBiYa",
																																																																						"Colombia",
																																																																						"哥倫比亞",
																																																																						9999), DK(
																																																																								37,
																																																																								"丹麦",
																																																																								"^(00){0,1}(45){1}\\d{6,12}$",
																																																																								"45",
																																																																								"DK",
																																																																								"DanMai",
																																																																								"Denmark",
																																																																								"丹麥",
																																																																								9999), EE(
																																																																										38,
																																																																										"爱沙尼亚",
																																																																										"^(00){0,1}(372){1}\\d{6,12}$",
																																																																										"372",
																																																																										"EE",
																																																																										"AiShaNiYa",
																																																																										"Estonia",
																																																																										"愛沙尼亞",
																																																																										9999), EG(
																																																																												39,
																																																																												"埃及",
																																																																												"^(00){0,1}(20){1}\\d{6,12}$",
																																																																												"20",
																																																																												"EG",
																																																																												"AiJi",
																																																																												"Egypt",
																																																																												"埃及",
																																																																												9999), ES(
																																																																														40,
																																																																														"西班牙",
																																																																														"^(00){0,1}(34){1}\\d{6,12}$",
																																																																														"34",
																																																																														"ES",
																																																																														"XiBanYa",
																																																																														"Spain",
																																																																														"西班牙",
																																																																														9999), FI(
																																																																																41,
																																																																																"芬兰",
																																																																																"^(00){0,1}(358){1}\\d{6,12}$",
																																																																																"358",
																																																																																"FI",
																																																																																"FenLan",
																																																																																"Finland",
																																																																																"芬蘭",
																																																																																9999), GR(
																																																																																		42,
																																																																																		"希腊",
																																																																																		"^(00){0,1}(30){1}\\d{6,12}$",
																																																																																		"30",
																																																																																		"GR",
																																																																																		"XiLa",
																																																																																		"Greece",
																																																																																		"希臘",
																																																																																		9999), HU(
																																																																																				43,
																																																																																				"匈牙利",
																																																																																				"^(00){0,1}(36){1}\\d{6,12}$",
																																																																																				"36",
																																																																																				"HU",
																																																																																				"XiongyaLi",
																																																																																				"Hungary",
																																																																																				"匈牙利",
																																																																																				9999), IE(
																																																																																						44,
																																																																																						"爱尔兰",
																																																																																						"^(00){0,1}(353){1}\\d{6,12}$",
																																																																																						"353",
																																																																																						"IE",
																																																																																						"AiErLan",
																																																																																						"Ireland",
																																																																																						"愛爾蘭",
																																																																																						9999), IL(
																																																																																								45,
																																																																																								"以色列",
																																																																																								"^(00){0,1}(972){1}\\d{6,12}$",
																																																																																								"972",
																																																																																								"IL",
																																																																																								"YiSeLie",
																																																																																								"Israel",
																																																																																								"以色列",
																																																																																								9999), IN(
																																																																																										46,
																																																																																										"印度",
																																																																																										"^(00){0,1}(91){1}\\d{6,12}$",
																																																																																										"91",
																																																																																										"IN",
																																																																																										"YinDu",
																																																																																										"India",
																																																																																										"印度",
																																																																																										9999), JO(
																																																																																												47,
																																																																																												"约旦",
																																																																																												"^(00){0,1}(962){1}\\d{6,12}$",
																																																																																												"962",
																																																																																												"JO",
																																																																																												"YueDan",
																																																																																												"Jordan",
																																																																																												"約旦",
																																																																																												9999), KG(
																																																																																														48,
																																																																																														"吉尔吉斯斯坦",
																																																																																														"^(00){0,1}(996){1}\\d{6,12}$",
																																																																																														"996",
																																																																																														"KG",
																																																																																														"JiErJiSiSiTan",
																																																																																														"Kyrgyzstan",
																																																																																														"吉爾吉斯坦共和國",
																																																																																														9999), KH(
																																																																																																49,
																																																																																																"柬埔寨",
																																																																																																"^(00){0,1}(855){1}\\d{6,12}$",
																																																																																																"855",
																																																																																																"KH",
																																																																																																"JianPuZhai",
																																																																																																"Cambodia",
																																																																																																"柬埔寨",
																																																																																																9999), LK(
																																																																																																		50,
																																																																																																		"斯里兰卡",
																																																																																																		"^(00){0,1}(94){1}\\d{6,12}$",
																																																																																																		"94",
																																																																																																		"LK",
																																																																																																		"SiLiLanKa",
																																																																																																		"Sri Lanka",
																																																																																																		"斯里蘭卡",
																																																																																																		9999), LT(
																																																																																																				51,
																																																																																																				"立陶宛",
																																																																																																				"^(00){0,1}(370){1}\\d{6,12}$",
																																																																																																				"370",
																																																																																																				"LT",
																																																																																																				"LiTaoWan",
																																																																																																				"Lithuania",
																																																																																																				"立陶宛",
																																																																																																				9999), LU(
																																																																																																						52,
																																																																																																						"卢森堡",
																																																																																																						"^(00){0,1}(352){1}\\d{6,12}$",
																																																																																																						"352",
																																																																																																						"LU",
																																																																																																						"LuSenBao",
																																																																																																						"Luxembourg",
																																																																																																						"盧森堡",
																																																																																																						9999), MA(
																																																																																																								53,
																																																																																																								"摩洛哥",
																																																																																																								"^(00){0,1}(212){1}\\d{6,12}$",
																																																																																																								"212",
																																																																																																								"MA",
																																																																																																								"MoLuoGe",
																																																																																																								"Morocco",
																																																																																																								"摩洛哥",
																																																																																																								9999), MN(
																																																																																																										54,
																																																																																																										"蒙古",
																																																																																																										"^(00){0,1}(976){1}\\d{6,12}$",
																																																																																																										"976",
																																																																																																										"MN",
																																																																																																										"MengGu",
																																																																																																										"Mongolia",
																																																																																																										"蒙古",
																																																																																																										9999), MV(
																																																																																																												55,
																																																																																																												"马尔代夫",
																																																																																																												"^(00){0,1}(960){1}\\d{6,12}$",
																																																																																																												"960",
																																																																																																												"MV",
																																																																																																												"MaErDaiFu",
																																																																																																												"Maldives",
																																																																																																												"馬爾地夫",
																																																																																																												9999), MX(
																																																																																																														56,
																																																																																																														"墨西哥",
																																																																																																														"^(00){0,1}(52){1}\\d{6,12}$",
																																																																																																														"52",
																																																																																																														"MX",
																																																																																																														"MoXiGe",
																																																																																																														"Mexico",
																																																																																																														"墨西哥",
																																																																																																														9999), NG(
																																																																																																																57,
																																																																																																																"尼日利亚",
																																																																																																																"^(00){0,1}(234){1}\\d{6,12}$",
																																																																																																																"234",
																																																																																																																"NG",
																																																																																																																"NiRiLiYa",
																																																																																																																"Nigeria",
																																																																																																																"奈及利亞",
																																																																																																																9999), NO(
																																																																																																																		58,
																																																																																																																		"挪威",
																																																																																																																		"^(00){0,1}(47){1}\\d{6,12}$",
																																																																																																																		"47",
																																																																																																																		"NO",
																																																																																																																		"NuoWei",
																																																																																																																		"Norway",
																																																																																																																		"挪威",
																																																																																																																		9999), PA(
																																																																																																																				59,
																																																																																																																				"巴拿马",
																																																																																																																				"^(00){0,1}(507){1}\\d{6,12}$",
																																																																																																																				"507",
																																																																																																																				"PA",
																																																																																																																				"BaNaMa",
																																																																																																																				"Panama",
																																																																																																																				"巴拿馬",
																																																																																																																				9999), PE(
																																																																																																																						60,
																																																																																																																						"秘鲁",
																																																																																																																						"^(00){0,1}(51){1}\\d{6,12}$",
																																																																																																																						"51",
																																																																																																																						"PE",
																																																																																																																						"MiLu",
																																																																																																																						"Peru",
																																																																																																																						"秘魯",
																																																																																																																						9999), PL(
																																																																																																																								61,
																																																																																																																								"波兰",
																																																																																																																								"^(00){0,1}(48){1}\\d{6,12}$",
																																																																																																																								"48",
																																																																																																																								"PL",
																																																																																																																								"BoLan",
																																																																																																																								"Poland",
																																																																																																																								"波蘭",
																																																																																																																								9999), PT(
																																																																																																																										62,
																																																																																																																										"葡萄牙",
																																																																																																																										"^(00){0,1}(351){1}\\d{6,12}$",
																																																																																																																										"351",
																																																																																																																										"PT",
																																																																																																																										"PUTaoYa",
																																																																																																																										"Portugal",
																																																																																																																										"葡萄牙",
																																																																																																																										9999), QA(
																																																																																																																												63,
																																																																																																																												"卡塔尔",
																																																																																																																												"^(00){0,1}(974){1}\\d{6,12}$",
																																																																																																																												"974",
																																																																																																																												"QA",
																																																																																																																												"KaTaEr",
																																																																																																																												"Qatar",
																																																																																																																												"卡達",
																																																																																																																												9999), RO(
																																																																																																																														64,
																																																																																																																														"罗马尼亚",
																																																																																																																														"^(00){0,1}(40){1}\\d{6,12}$",
																																																																																																																														"40",
																																																																																																																														"RO",
																																																																																																																														"LuoMaNiYa",
																																																																																																																														"Romania",
																																																																																																																														"羅馬尼亞",
																																																																																																																														9999), RS(
																																																																																																																																65,
																																																																																																																																"塞尔维亚",
																																																																																																																																"^(00){0,1}(381){1}\\d{6,12}$",
																																																																																																																																"381",
																																																																																																																																"RS",
																																																																																																																																"SaiErWeiYa",
																																																																																																																																"Serbia",
																																																																																																																																"塞爾維亞",
																																																																																																																																9999), SA(
																																																																																																																																		66,
																																																																																																																																		"沙特阿拉伯",
																																																																																																																																		"^(00){0,1}(966){1}\\d{6,12}$",
																																																																																																																																		"966",
																																																																																																																																		"SA",
																																																																																																																																		"ShaTeALaBo",
																																																																																																																																		"Saudi Arabia",
																																																																																																																																		"沙烏地阿拉伯",
																																																																																																																																		9999), SC(
																																																																																																																																				67,
																																																																																																																																				"塞舌尔",
																																																																																																																																				"^(00){0,1}(248){1}\\d{6,12}$",
																																																																																																																																				"248",
																																																																																																																																				"SC",
																																																																																																																																				"SaiSheEr",
																																																																																																																																				"Seychelles",
																																																																																																																																				"塞席爾",
																																																																																																																																				9999), TN(
																																																																																																																																						68,
																																																																																																																																						"突尼斯",
																																																																																																																																						"^(00){0,1}(216){1}\\d{6,12}$",
																																																																																																																																						"216",
																																																																																																																																						"TN",
																																																																																																																																						"TuNiSi",
																																																																																																																																						"Tunisia",
																																																																																																																																						"突尼斯",
																																																																																																																																						9999), TR(
																																																																																																																																								69,
																																																																																																																																								"土耳其",
																																																																																																																																								"^(00){0,1}(90){1}\\d{6,12}$",
																																																																																																																																								"90",
																																																																																																																																								"TR",
																																																																																																																																								"TuErQi",
																																																																																																																																								"Turkey",
																																																																																																																																								"土耳其",
																																																																																																																																								9999), VE(
																																																																																																																																										70,
																																																																																																																																										"委内瑞拉",
																																																																																																																																										"^(00){0,1}(58){1}\\d{6,12}$",
																																																																																																																																										"58",
																																																																																																																																										"VE",
																																																																																																																																										"WeiNeiRuiLa",
																																																																																																																																										"Venezuela",
																																																																																																																																										"委內瑞拉",
																																																																																																																																										9999), VG(
																																																																																																																																												71,
																																																																																																																																												"英属维尔京群岛",
																																																																																																																																												"^(00){0,1}(1284){1}\\d{6,12}$",
																																																																																																																																												"1284",
																																																																																																																																												"VG",
																																																																																																																																												"YingShuWeiErJingQunDao",
																																																																																																																																												"Virgin Islands, British",
																																																																																																																																												"英屬維京群島",
																																																																																																																																												9999), ZA(
																																																																																																																																														72,
																																																																																																																																														"南非",
																																																																																																																																														"^(00){0,1}(27){1}\\d{6,12}$",
																																																																																																																																														"27",
																																																																																																																																														"ZA",
																																																																																																																																														"NanFei",
																																																																																																																																														"South Africa",
																																																																																																																																														"南非",
																																																																																																																																														9999);

		private RegisterSupportMobileArea(int selIndex, String name, String checkPattern, String areaCode,
				String abbreviation, String pinyin, String areaEngName, String areaZhTname, int sortWeightKey) {
			areaId = selIndex;
			areaName = name;
			this.checkKey = checkPattern;
			this.code = areaCode;
			this.domainAbbreviation = abbreviation;
			this.pinyin = pinyin;
			this.areaEnglishName = areaEngName;
			this.areaChineseTranditionalName = areaZhTname;
			this.setSortWeightKey(sortWeightKey);
		}

		// 地区ID
		int areaId;
		// 地区名
		String areaName;
		// 正则表达式
		String checkKey;
		// 地区的电话区号
		String code;
		// 域名缩写
		String domainAbbreviation;
		// 拼音
		private String pinyin;
		// 地区英文名
		private String areaEnglishName;
		// 地区繁体名
		private String areaChineseTranditionalName;
		// 权重排序key，数字越大排名越后
		private int sortWeightKey;

		public int getAreaId() {
			return areaId;
		}

		public String getAreaName() {
			return areaName;
		}

		public String getCheckKey() {
			return checkKey;
		}

		public String getCommonCheckKeyForNation() {
			return "\\d+";
		}

		public String getCode() {
			return code;
		}

		public String getDomainAbbreviation() {
			return domainAbbreviation;
		}

		public static RegisterSupportMobileArea domainAbbreviationOf(String abbreviation) {
			for (RegisterSupportMobileArea a : values()) {
				if (a.domainAbbreviation.equalsIgnoreCase(abbreviation)) {
					return a;
				}
			}
			return null;
		}

		public static RegisterSupportMobileArea areaNameOf(String areaName) {
			for (RegisterSupportMobileArea a : values()) {
				if (a.areaName.equalsIgnoreCase(areaName)) {
					return a;
				}
			}
			return null;
		}

		public static RegisterSupportMobileArea areaCodeOf(String code) {
			for (RegisterSupportMobileArea a : values()) {
				if (a.code.equalsIgnoreCase(code)) {
					return a;
				}
			}

			return null;
		}

		public static RegisterSupportMobileArea areaIdOf(int areaId) {
			for (RegisterSupportMobileArea a : values()) {
				if (a.areaId == areaId) {
					return a;
				}
			}
			return null;
		}

		public String getPinyin() {
			return pinyin;
		}

		public void setPinyin(String pinyin) {
			this.pinyin = pinyin;
		}

		public String getAreaEnglishName() {
			return areaEnglishName;
		}

		public void setAreaEnglishName(String areaEnglishName) {
			this.areaEnglishName = areaEnglishName;
		}

		public String getAreaChineseTranditionalName() {
			return areaChineseTranditionalName;
		}

		public void setAreaChineseTranditionalName(String areaChineseTranditionalName) {
			this.areaChineseTranditionalName = areaChineseTranditionalName;
		}

		public int getSortWeightKey() {
			return sortWeightKey;
		}

		public void setSortWeightKey(int sortWeightKey) {
			this.sortWeightKey = sortWeightKey;
		}
	}
}
